Autodesk.Revit.DB.Architecture.CutMarkSymbol
The available shapes for the cut mark symbol.
Since:
2013

Autodesk.Revit.DB.Architecture.CutMarkSymbol.Curve
Cut mark shape is curved.

Autodesk.Revit.DB.Architecture.CutMarkSymbol.Zigzag
Cut mark shape is zigzagged.

Autodesk.Revit.DB.Architecture.CutMarkSymbol.None
Cut mark shape is linear.